## Plan Result (ptl)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 0 to change, 9 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.ptl_implicit_managed_identity_access_policy[0]
  * module.version_reporter_key_vault[0].azurerm_key_vault.kv
  * module.version_reporter_key_vault[0].azurerm_key_vault_access_policy.creator_access_policy
  * module.version_reporter_key_vault[0].azurerm_key_vault_access_policy.developer[0]
  * module.version_reporter_key_vault[0].azurerm_key_vault_access_policy.product_team_access_policy
  * module.version_reporter_key_vault[0].azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * azurerm_key_vault_access_policy.implicit_managed_identity_access_policy
  * module.version_reporter_key_vault.azurerm_key_vault.kv
  * module.version_reporter_key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.version_reporter_key_vault.azurerm_key_vault_access_policy.developer[0]
  * module.version_reporter_key_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.version_reporter_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * azurerm_key_vault_secret.cosmos_endpoint[0]
  * azurerm_key_vault_secret.cosmos_key[0]
  * azurerm_key_vault_secret.cosmosdb_database_name[0]
* Move
  * azurerm_cosmosdb_account.this => azurerm_cosmosdb_account.this[0]
  * azurerm_cosmosdb_sql_database.this => azurerm_cosmosdb_sql_database.this[0]
  * azurerm_cosmosdb_sql_role_assignment.this => azurerm_cosmosdb_sql_role_assignment.this[0]
  * azurerm_key_vault_secret.cosmos_endpoint => azurerm_key_vault_secret.cosmos_endpoint[0]
  * azurerm_key_vault_secret.cosmos_key => azurerm_key_vault_secret.cosmos_key[0]
  * azurerm_key_vault_secret.cosmosdb_database_name => azurerm_key_vault_secret.cosmosdb_database_name[0]
  * azurerm_resource_group.this => azurerm_resource_group.this[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_account.this has moved to azurerm_cosmosdb_account.this[0]
    resource "azurerm_cosmosdb_account" "this" {
        id                                       = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.DocumentDB/databaseAccounts/version-reporter-ptl-cosmos"
        name                                     = "version-reporter-ptl-cosmos"
        tags                                     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/version-reporter-services"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (34 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_cosmosdb_sql_database.this has moved to azurerm_cosmosdb_sql_database.this[0]
    resource "azurerm_cosmosdb_sql_database" "this" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.DocumentDB/databaseAccounts/version-reporter-ptl-cosmos/sqlDatabases/reports"
        name                = "reports"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_cosmosdb_sql_role_assignment.this has moved to azurerm_cosmosdb_sql_role_assignment.this[0]
    resource "azurerm_cosmosdb_sql_role_assignment" "this" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.DocumentDB/databaseAccounts/version-reporter-ptl-cosmos/sqlRoleAssignments/73a6243a-2d74-56b6-a1c8-17beb5ac49b9"
        name                = "73a6243a-2d74-56b6-a1c8-17beb5ac49b9"
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_access_policy.implicit_managed_identity_access_policy will be destroyed
  # (because azurerm_key_vault_access_policy.implicit_managed_identity_access_policy is not in configuration)
  - resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl/objectId/7a1203c4-1443-46d8-96c4-496492196efd" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl" -> null
      - object_id               = "7a1203c4-1443-46d8-96c4-496492196efd" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.ptl_implicit_managed_identity_access_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "ptl_implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7a1203c4-1443-46d8-96c4-496492196efd"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_secret.cosmos_endpoint[0] must be replaced
  # (moved from azurerm_key_vault_secret.cosmos_endpoint)
-/+ resource "azurerm_key_vault_secret" "cosmos_endpoint" {
      ~ id                      = "https://version-reporter-ptl.vault.azure.net/secrets/cosmos-endpoint/ebb6f72062a64fe580a6cdd8864c4b20" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl" # forces replacement -> (known after apply) # forces replacement
        name                    = "cosmos-endpoint"
      ~ resource_id             = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl/secrets/cosmos-endpoint/versions/ebb6f72062a64fe580a6cdd8864c4b20" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl/secrets/cosmos-endpoint" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "ebb6f72062a64fe580a6cdd8864c4b20" -> (known after apply)
      ~ versionless_id          = "https://version-reporter-ptl.vault.azure.net/secrets/cosmos-endpoint" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.cosmos_key[0] must be replaced
  # (moved from azurerm_key_vault_secret.cosmos_key)
-/+ resource "azurerm_key_vault_secret" "cosmos_key" {
      ~ id                      = "https://version-reporter-ptl.vault.azure.net/secrets/cosmos-key/b8b3c414980549ad927475d507aa2e76" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl" # forces replacement -> (known after apply) # forces replacement
        name                    = "cosmos-key"
      ~ resource_id             = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl/secrets/cosmos-key/versions/b8b3c414980549ad927475d507aa2e76" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl/secrets/cosmos-key" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "b8b3c414980549ad927475d507aa2e76" -> (known after apply)
      ~ versionless_id          = "https://version-reporter-ptl.vault.azure.net/secrets/cosmos-key" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.cosmosdb_database_name[0] must be replaced
  # (moved from azurerm_key_vault_secret.cosmosdb_database_name)
-/+ resource "azurerm_key_vault_secret" "cosmosdb_database_name" {
      ~ id                      = "https://version-reporter-ptl.vault.azure.net/secrets/cosmos-db-name/eddbadb404d74a53aad50bf9d5feefe7" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl" # forces replacement -> (known after apply) # forces replacement
        name                    = "cosmos-db-name"
      ~ resource_id             = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl/secrets/cosmos-db-name/versions/eddbadb404d74a53aad50bf9d5feefe7" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl/secrets/cosmos-db-name" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "eddbadb404d74a53aad50bf9d5feefe7" -> (known after apply)
      ~ versionless_id          = "https://version-reporter-ptl.vault.azure.net/secrets/cosmos-db-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_resource_group.this has moved to azurerm_resource_group.this[0]
    resource "azurerm_resource_group" "this" {
        id         = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg"
        name       = "cft-platform-version-reporter-ptl-rg"
        tags       = {
            "application"  = "core"
            "builtFrom"    = "hmcts/version-reporter-services"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (2 unchanged attributes hidden)
    }

  # module.version_reporter_key_vault.azurerm_key_vault.kv will be destroyed
  # (because module.version_reporter_key_vault is not in configuration)
  - resource "azurerm_key_vault" "kv" {
      - access_policy                   = [
          - {
              - certificate_permissions = [
                  - "Create",
                  - "Delete",
                  - "DeleteIssuers",
                  - "Get",
                  - "GetIssuers",
                  - "Import",
                  - "List",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "Update",
                  - "ManageContacts",
                  - "ManageIssuers",
                ]
              - key_permissions         = [
                  - "Create",
                  - "List",
                  - "Get",
                  - "Delete",
                  - "Update",
                  - "Import",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Sign",
                  - "Verify",
                  - "GetRotationPolicy",
                ]
              - object_id               = "b8f08f77-4ce2-43d5-a23b-c7ca735eca02"
              - secret_permissions      = [
                  - "Set",
                  - "List",
                  - "Get",
                  - "Delete",
                  - "Recover",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = [
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                  - "Recover",
                ]
              - key_permissions         = [
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                ]
              - object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
              - secret_permissions      = [
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = [
                  - "Get",
                  - "List",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                ]
              - object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = [
                  - "Get",
                  - "List",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                ]
              - object_id               = "7a1203c4-1443-46d8-96c4-496492196efd"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - enable_rbac_authorization       = false -> null
      - enabled_for_deployment          = true -> null
      - enabled_for_disk_encryption     = true -> null
      - enabled_for_template_deployment = true -> null
      - id                              = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl" -> null
      - location                        = "uksouth" -> null
      - name                            = "version-reporter-ptl" -> null
      - public_network_access_enabled   = true -> null
      - purge_protection_enabled        = true -> null
      - resource_group_name             = "cft-platform-version-reporter-ptl-rg" -> null
      - sku_name                        = "standard" -> null
      - soft_delete_retention_days      = 90 -> null
      - tags                            = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/version-reporter-services"
          - "businessArea" = "CFT"
          - "criticality"  = "High"
          - "environment"  = "production"
          - "startupMode"  = "always"
        } -> null
      - tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
      - vault_uri                       = "https://version-reporter-ptl.vault.azure.net/" -> null

      - network_acls {
          - bypass                     = "AzureServices" -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }
    }

  # module.version_reporter_key_vault.azurerm_key_vault_access_policy.creator_access_policy will be destroyed
  # (because module.version_reporter_key_vault is not in configuration)
  - resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      - certificate_permissions = [
          - "Create",
          - "Delete",
          - "DeleteIssuers",
          - "Get",
          - "GetIssuers",
          - "Import",
          - "List",
          - "ListIssuers",
          - "SetIssuers",
          - "Update",
          - "ManageContacts",
          - "ManageIssuers",
        ] -> null
      - id                      = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl/objectId/b8f08f77-4ce2-43d5-a23b-c7ca735eca02" -> null
      - key_permissions         = [
          - "Create",
          - "List",
          - "Get",
          - "Delete",
          - "Update",
          - "Import",
          - "Backup",
          - "Restore",
          - "Decrypt",
          - "Encrypt",
          - "UnwrapKey",
          - "WrapKey",
          - "Sign",
          - "Verify",
          - "GetRotationPolicy",
        ] -> null
      - key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl" -> null
      - object_id               = "b8f08f77-4ce2-43d5-a23b-c7ca735eca02" -> null
      - secret_permissions      = [
          - "Set",
          - "List",
          - "Get",
          - "Delete",
          - "Recover",
          - "Purge",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # module.version_reporter_key_vault.azurerm_key_vault_access_policy.developer[0] will be destroyed
  # (because module.version_reporter_key_vault is not in configuration)
  - resource "azurerm_key_vault_access_policy" "developer" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl" -> null
      - object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # module.version_reporter_key_vault.azurerm_key_vault_access_policy.product_team_access_policy will be destroyed
  # (because module.version_reporter_key_vault is not in configuration)
  - resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      - certificate_permissions = [
          - "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "ManageContacts",
          - "ManageIssuers",
          - "GetIssuers",
          - "ListIssuers",
          - "SetIssuers",
          - "DeleteIssuers",
          - "Recover",
        ] -> null
      - id                      = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl/objectId/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - key_permissions         = [
          - "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "Recover",
        ] -> null
      - key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl" -> null
      - object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - secret_permissions      = [
          - "List",
          - "Set",
          - "Delete",
          - "Recover",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # module.version_reporter_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be destroyed
  # (because module.version_reporter_key_vault is not in configuration)
  - resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      - id                             = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl|version-reporter-ptl" -> null
      - log_analytics_destination_type = "AzureDiagnostics" -> null
      - log_analytics_workspace_id     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod" -> null
      - name                           = "version-reporter-ptl" -> null
      - target_resource_id             = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl" -> null
        # (2 unchanged attributes hidden)

      - enabled_log {
          - category       = "AuditEvent" -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - log {
          - category       = "AuditEvent" -> null
          - enabled        = true -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category       = "AzurePolicyEvaluationDetails" -> null
          - enabled        = false -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.version_reporter_key_vault[0].azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "version-reporter-ptl"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "cft-platform-version-reporter-ptl-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/version-reporter-services"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.version_reporter_key_vault[0].azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b8f08f77-4ce2-43d5-a23b-c7ca735eca02"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.version_reporter_key_vault[0].azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.version_reporter_key_vault[0].azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.version_reporter_key_vault[0].azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + name                           = "version-reporter-ptl"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "AuditEvent"
            # (1 unchanged attribute hidden)
        }
    }

Plan: 9 to add, 0 to change, 9 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":162,"Program":"tfcmt","SHA1":"","Target":"ptl","Vars":{}} -->